Documents/ОтменаЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ОтменаЗанятия</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Занятие</Name>
      <ValueType><v8:Type>cfg:DocumentRef.Занятие</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.Занятие</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Причина</Name>
      <ValueType><v8:Type>cfg:EnumRef.ПричиныОтмены</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ПричиныОтмены</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОтмены</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СписыватьЗанятие</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВозвращатьЗанятие</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВозвращатьОплату</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыЗанятия</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Запланировано</Name>
    </Value>
    <Value>
      <Name>Подтверждено</Name>
    </Value>
    <Value>
      <Name>Проведено</Name>
    </Value>
    <Value>
      <Name>Отменено</Name>
    </Value>
    <Value>
      <Name>Перенесено</Name>
    </Value>
    <Value>
      <Name>НеСостоялось</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыПосещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыПосещения</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Присутствовал</Name>
    </Value>
    <Value>
      <Name>Отсутствовал</Name>
    </Value>
    <Value>
      <Name>ОтменилЗаранее</Name>
    </Value>
    <Value>
      <Name>ОтменилПоздно</Name>
    </Value>
    <Value>
      <Name>УважительнаяПричина</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/ОтменаЗанятия/Ext/ObjectModule.bsl
// Модуль документа Отмена занятия

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ЗанятиеОбъект = Занятие.ПолучитьОбъект();
	ЗанятиеОбъект.Статус = Перечисления.СтатусыЗанятия.Отменено;
	ЗанятиеОбъект.Записать();

	// Возврат занятий на баланс абонемента
	Если ВозвращатьЗанятие Тогда
		ДвиженияОстатки = Новый Массив;
		СписокАбонементов = Новый Массив;
		Для Каждого Участник ИЗ ЗанятиеОбъект.Участники Цикл
			Если Не ПустоеЗначение(Участник.Абонемент) И Участник.СтатусПосещения = Перечисления.СтатусыПосещения.Присутствовал Тогда
				ДвижениеОстатки = Новый Структура("ВидДвижения, АбонементКлиента, КоличествоЗанятий");
				ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
				ДвижениеОстатки.АбонементКлиента = Участник.Абонемент;
				ДвижениеОстатки.КоличествоЗанятий = 1;
				ДвиженияОстатки.Добавить(ДвижениеОстатки);
				Если СписокАбонементов.Найти(Участник.Абонемент) = Неопределено Тогда
					СписокАбонементов.Добавить(Участник.Абонемент);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ДвиженияОстатки.Количество() > 0 Тогда
			РаботаСОстаткамиАбонементов.ЗаписатьДвиженияОстатки(Ссылка, Дата, ДвиженияОстатки);
			Для Каждого АбонементКлиента ИЗ СписокАбонементов Цикл
				РаботаСОстаткамиАбонементов.ОбновитьИспользованоПоАбонементу(АбонементКлиента);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Отмена занятия", "", "Причина=" + Строка(Причина));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Занятие) Тогда
		Сообщить("Не указано занятие");
		Отказ = Истина;
	КонецЕсли;
	Если ПустоеЗначение(Причина) Тогда
		Сообщить("Не указана причина отмены");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
